In [1]:
import numpy as np

In [2]:
import pandas as pd

In [19]:
label=['a','b','c']
my_data=[10,20,30]
arr= np.array(my_data)
d={'a':10,'b':20,'c':30}

In [20]:
arr

array([10, 20, 30])

In [21]:
pd.Series(data=label,index=d)

a    a
b    b
c    c
dtype: object

In [22]:
d

{'a': 10, 'b': 20, 'c': 30}

In [23]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [25]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [26]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [29]:
ser1[3]

4

In [32]:
ser2

USA      1
Italy    2
Korea    3
Japan    4
dtype: int64

In [30]:
ser2=pd.Series([1,2,3,4],['USA','Italy','Korea','Japan'])

In [31]:
ser1+ser2

Germany    NaN
Italy      NaN
Japan      8.0
Korea      NaN
USA        2.0
USSR       NaN
dtype: float64

In [33]:
#dataframes

In [34]:
from numpy.random import randn

In [35]:
np.random.seed(101)

In [50]:
df=pd.DataFrame(randn(5,4), ['a','b','c','d','e'],['W','X','Y','Z'])

In [51]:
df

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [53]:
df['Y']

a   -1.706086
b    0.166905
c    0.638787
d   -0.943406
e    0.238127
Name: Y, dtype: float64

In [54]:
type(df)

pandas.core.frame.DataFrame

In [55]:
df.W

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
e   -0.116773
Name: W, dtype: float64

In [56]:
df[['W','Z']]

          W         Z
a  0.302665 -1.159119
b -0.134841  0.184502
c  0.807706  0.329646
d -0.497104  0.484752
e -0.116773  1.996652

In [57]:
df['new']=df.W+df['Z']

In [58]:
df

          W         X         Y         Z       new
a  0.302665  1.693723 -1.706086 -1.159119 -0.856454
b -0.134841  0.390528  0.166905  0.184502  0.049661
c  0.807706  0.072960  0.638787  0.329646  1.137352
d -0.497104 -0.754070 -0.943406  0.484752 -0.012352
e -0.116773  1.901755  0.238127  1.996652  1.879879

In [62]:
df=df.drop('new',axis=1)

In [63]:
df

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [64]:
df.drop('e',inplace=False)

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752

In [65]:
df

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [66]:
df['Z']

a   -1.159119
b    0.184502
c    0.329646
d    0.484752
e    1.996652
Name: Z, dtype: float64

In [67]:
df.loc['e']

W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: e, dtype: float64

In [68]:
df.iloc[4]

W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: e, dtype: float64

In [70]:
df.loc['b','Y']

0.16690463609281317

In [84]:
df.loc[['a','b'],['X','Z']]

          X         Z
a  1.693723 -1.159119
b  0.390528  0.184502

In [86]:
df[df<0.5]

          W         X         Y         Z
a  0.302665       NaN -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c       NaN  0.072960       NaN  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773       NaN  0.238127       NaN

In [87]:
df>0

       W      X      Y      Z
a   True   True  False  False
b  False   True   True   True
c   True   True   True   True
d  False  False  False   True
e  False   True   True   True

In [92]:
boola=df>0

In [93]:
boola

       W      X      Y      Z
a   True   True  False  False
b  False   True   True   True
c   True   True   True   True
d  False  False  False   True
e  False   True   True   True

In [102]:
df[df['X']>0]

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
e -0.116773  1.901755  0.238127  1.996652

In [103]:
df['W']>0

a     True
b    False
c     True
d    False
e    False
Name: W, dtype: bool

In [104]:
type(df['W'])

pandas.core.series.Series

In [110]:
df[df['Z']<0][['X','Y']]

          X         Y
a  1.693723 -1.706086

In [118]:
df[(df['X']>0) & (df['Y']>0)]

          W         X         Y         Z
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
e -0.116773  1.901755  0.238127  1.996652

In [119]:
df

          W         X         Y         Z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [127]:
df

   level_0 index         W         X         Y         Z
0        0     a  0.302665  1.693723 -1.706086 -1.159119
1        1     b -0.134841  0.390528  0.166905  0.184502
2        2     c  0.807706  0.072960  0.638787  0.329646
3        3     d -0.497104 -0.754070 -0.943406  0.484752
4        4     e -0.116773  1.901755  0.238127  1.996652

Index Levels

In [15]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [12]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index1=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index1)

In [13]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [16]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [17]:
df

             A         B
G1 1 -0.487320 -0.024417
   2  1.099727  0.560212
   3  0.580120 -1.022912
G2 1 -0.930534  0.109533
   2  0.070081 -1.561472
   3  2.521444 -0.803114

In [21]:
df.loc['G1'].loc[3]

A    0.580120
B   -1.022912
Name: 3, dtype: float64

In [23]:
df.index.names=['Groups','Num']

In [24]:
df

                   A         B
Groups Num
G1     1   -0.487320 -0.024417
       2    1.099727  0.560212
       3    0.580120 -1.022912
G2     1   -0.930534  0.109533
       2    0.070081 -1.561472
       3    2.521444 -0.803114

In [28]:
df.loc['G2'].loc[2]['B']

-1.5614721428961997

In [31]:
df.loc['G2']['A'].loc[2]

0.07008142540820267

In [32]:
df

                   A         B
Groups Num
G1     1   -0.487320 -0.024417
       2    1.099727  0.560212
       3    0.580120 -1.022912
G2     1   -0.930534  0.109533
       2    0.070081 -1.561472
       3    2.521444 -0.803114

In [35]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.487320 -0.024417
G2     -0.930534  0.109533

In [37]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [38]:
df=pd.DataFrame(d)

In [39]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [45]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [46]:
df.fillna(value='gg')

    A   B  C
0   1   5  1
1   2  gg  2
2  gg  gg  3

Groupby

In [47]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [48]:
df=pd.DataFrame(data)

In [49]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [52]:
myCom=df.groupby('Company')

In [54]:
myCom.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [55]:
myCom.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [57]:
myCom.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [60]:
df.groupby('Company').sum().min()

Sales    320
dtype: int64

In [61]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [65]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [66]:
def times(x):
    return X*2

In [71]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [72]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('example')

In [4]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
df.to_csv('My_output',index=False)

In [11]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
df.to_excel('Excel_out.xlsx')